tap "homebrew/bundle"
tap "caskroom/cask"
tap "caskroom/fonts"

brew "zsh"
brew "zsh-completions"
brew "git"
brew "git-flow"
brew "nvm"
brew "go"
brew "cowsay"
brew "asciinema"
brew "mas"
brew "coreutils"
brew "moreutils"
brew "ack"
brew "grep"
brew "screen"
brew "youtube-dl"
brew "watch"
brew "wget"
brew "xz"
brew "tree"
brew "gnu-sed", args: ["default-names"]
brew "vim", args: ["override-system-vi"]
brew "packer"
brew "httpie"
brew "httpstat"
brew "pow"
brew "gpg-agent"
brew "gnupg"
brew "tmux"
brew "fzf"

# Tools for Github
brew "hub"
brew "gist"

cask_args appdir: "/Applications"

# Install developer friendly quick look plugins
# see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlprettypatch"
cask "quicklook-csv"
cask "betterzipql"
cask "qlimagesize" 
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Preview iOS / macOS app and provision information
cask "ProvisionQL"

# Preview Android APK files
cask "quicklookapk"

cask "the-unarchiver"
cask "typora"
cask "alfred"
cask "vmware-fusion"
cask "1password"
cask "things"
cask "keepingyouawake"
cask "hazel"
cask "rescuetime"

# Developer Tools
cask "hyper"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "now"
cask "vagrant"
cask "visual-studio-code"
cask "charles"
cask "livereload"
cask "webstorm"
cask "intellij-idea"
cask "ngrok"

# Browsers
cask "google-chrome"
cask "firefox"

# Font
cask "caskroom/fonts/font-fira-code"

# Utils
cask "ripit"

mas "Moom", id: 419330170
mas "Image2Icon", id: 992115977
mas "MindNode", id: 992076693
mas "Instant Translate", id: 1005088137
mas "ForkLift", id: 412448059
mas "Movist", id: 461788075
mas "Irvue", id: 1039633667
mas "Soulver", id: 413965349
mas "Slack", id: 803453959
mas "GIF Brewery 3", id: 1081413713
mas "Sip", id: 507257563
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Numbers", id: 409203825
mas "LINE", id: 539883307
mas "KakaoTalk", id: 869223134
mas "WinArchiver Lite", id: 414855915
mas "Twitter", id: 409789998
mas "Movist", id: 461788075
mas "Xcode", id: 497799835
